cezer-io/cezerio-blocks-arduino/boards.txt
# See: https://github.com/cezer-io/cezerio-blocks-arduino

##############################################################

cezerioblocks.name=cezerio Blocks

cezerioblocks.upload_port.0.board=cezerioBlocks

cezerioblocks.upload.tool=avrdude
cezerioblocks.upload.tool.default=avrdude
cezerioblocks.upload.tool.network=arduino_ota
cezerioblocks.upload.protocol=arduino
cezerioblocks.upload.maximum_size=30720
cezerioblocks.upload.maximum_data_size=2048
cezerioblocks.upload.speed=57600

cezerioblocks.bootloader.tool=avrdude
cezerioblocks.bootloader.tool.default=avrdude
cezerioblocks.bootloader.low_fuses=0xFF
cezerioblocks.bootloader.high_fuses=0xDA
cezerioblocks.bootloader.extended_fuses=0xFD
cezerioblocks.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex
cezerioblocks.bootloader.unlock_bits=0x3F
cezerioblocks.bootloader.lock_bits=0x0F

cezerioblocks.build.mcu=atmega328p
cezerioblocks.build.f_cpu=8000000L
cezerioblocks.build.board=AVR_CEZERIO_BLOCKS
cezerioblocks.build.core=arduino
cezerioblocks.build.variant=cezerioblocks

##############################################################
